{"washington":0,"20549":1,"mark":2,"one":3,"transition":4,"report":5,"pursuant":6,"section":7,"13":8,"15":9,"securities":10,"exchange":11,"act":12,"1934":13,"period":14,"from":15,"commission":16,"file":17,"number":18,"001":19,"36743":20,"picture":21,"28":22,"35":23,"intentionally":24,"omitted":25,"exact":26,"name":27,"registrant":28,"specified":29,"its":30,"charter":31,"california":32,"state":33,"other":34,"jurisdiction":35,"incorporation":36,"organization":37,"94":38,"2404110":39,"employer":40,"identification":41,"apple":42,"park":43,"way":44,"cupertino":45,"address":46,"principal":47,"executive":48,"offices":49,"95014":50,"zip":51,"code":52,"408":53,"996":54,"1010":55,"telephone":56,"including":57,"area":58,"registered":59,"12":60,"trading":61,"title":62,"each":63,"class":64,"symbol":65,"which":66,"common":67,"stock":68,"00001":69,"par":70,"value":71,"per":72,"share":73,"aapl":74,"nasdaq":75,"market":76,"llc":77,"000":78,"notes":79,"due":80,"2025":81,"625":82,"2026":83,"2027":84,"375":85,"2029":86,"050":87,"500":88,"2031":89,"600":90,"2042":91,"none":92,"indicate":93,"check":94,"well":95,"known":96,"seasoned":97,"issuer":98,"defined":99,"rule":100,"405":101,"yes":102,"required":103,"reports":104,"whether":105,"has":106,"filed":107,"all":108,"during":109,"preceding":110,"months":111,"shorter":112,"been":113,"subject":114,"filing":115,"requirements":116,"past":117,"90":118,"days":119,"submitted":120,"electronically":121,"every":122,"interactive":123,"data":124,"regulation":125,"232":126,"chapter":127,"submit":128,"files":129,"large":130,"accelerated":131,"filer":132,"non":133,"smaller":134,"reporting":135,"company":136,"emerging":137,"growth":138,"see":139,"definitions":140,"12b":141,"elected":142,"use":143,"extended":144,"complying":145,"any":146,"new":147,"revised":148,"financial":149,"accounting":150,"standards":151,"provided":152,"attestation":153,"management":154,"assessment":155,"effectiveness":156,"internal":157,"control":158,"over":159,"under":160,"404":161,"sarbanes":162,"oxley":163,"7262":164,"public":165,"firm":166,"prepared":167,"issued":168,"audit":169,"statements":170,"included":171,"reflect":172,"correction":173,"error":174,"previously":175,"those":176,"corrections":177,"restatements":178,"recovery":179,"analysis":180,"incentive":181,"based":182,"compensation":183,"received":184,"officers":185,"relevant":186,"240":187,"10d":188,"shell":189,"aggregate":190,"voting":191,"held":192,"affiliates":193,"march":194,"last":195,"business":196,"day":197,"most":198,"recently":199,"completed":200,"second":201,"fiscal":202,"quarter":203,"approximately":204,"253":205,"431":206,"solely":207,"purposes":208,"disclosure":209,"shares":210,"directors":211,"date":212,"have":213,"excluded":214,"because":215,"persons":216,"may":217,"deemed":218,"determination":219,"necessarily":220,"conclusive":221,"14":222,"776":223,"353":224,"were":225,"outstanding":226,"october":227,"17":228,"portions":229,"definitive":230,"proxy":231,"statement":232,"relating":233,"annual":234,"meeting":235,"shareholders":236,"incorporated":237,"reference":238,"part":239,"iii":240,"form":241,"10":242,"where":243,"indicated":244,"within":245,"120":246,"after":247,"end":248,"year":249,"relates":250,"page":251,"item":252,"1a":253,"risk":254,"factors":255,"1b":256,"unresolved":257,"staff":258,"comments":259,"1c":260,"cybersecurity":261,"properties":262,"legal":263,"proceedings":264,"18":265,"mine":266,"safety":267,"disclosures":268,"ii":269,"equity":270,"related":271,"stockholder":272,"matters":273,"purchases":274,"br":275,"19":276,"reserved":277,"20":278,"discussion":279,"condition":280,"results":281,"operations":282,"21":283,"7a":284,"quantitative":285,"qualitative":286,"about":287,"27":288,"supplementary":289,"changes":290,"disagreements":291,"accountants":292,"52":293,"9a":294,"controls":295,"procedures":296,"9b":297,"information":298,"53":299,"9c":300,"regarding":301,"foreign":302,"jurisdictions":303,"prevent":304,"inspections":305,"corporate":306,"governance":307,"11":308,"security":309,"ownership":310,"certain":311,"beneficial":312,"owners":313,"relationships":314,"transactions":315,"director":316,"independence":317,"accountant":318,"fees":319,"services":320,"iv":321,"exhibit":322,"schedules":323,"54":324,"16":325,"summary":326,"57":327,"_this":328,"contains":329,"forward":330,"looking":331,"meaning":332,"private":333,"litigation":334,"reform":335,"1995":336,"involve":337,"risks":338,"uncertainties":339,"many":340,"located":341,"heading":342,"provide":343,"current":344,"expectations":345,"future":346,"events":347,"assumptions":348,"include":349,"does":350,"directly":351,"relate":352,"historical":353,"fact":354,"example":355,"potential":356,"impact":357,"macroeconomic":358,"conditions":359,"tariffs":360,"measures":361,"forwardlooking":362,"can":363,"also":364,"identified":365,"words":366,"anticipates":367,"believes":368,"estimates":369,"expects":370,"intends":371,"plans":372,"predicts":373,"would":374,"could":375,"similar":376,"terms":377,"guarantees":378,"performance":379,"actual":380,"differ":381,"significantly":382,"discussed":383,"might":384,"cause":385,"differences":386,"limited":387,"assumes":388,"obligation":389,"revise":390,"update":391,"reason":392,"except":393,"law":394,"_unless":395,"otherwise":396,"stated":397,"presented":398,"herein":399,"calendar":400,"references":401,"particular":402,"years":403,"quarters":404,"periods":405,"refer":406,"ended":407,"september":408,"associated":409,"used":410,"refers":411,"collectively":412,"inc":413,"wholly":414,"owned":415,"subsidiaries":416,"unless":417,"designs":418,"manufactures":419,"markets":420,"smartphones":421,"personal":422,"computers":423,"tablets":424,"wearables":425,"accessories":426,"sells":427,"variety":428,"week":429,"ends":430,"saturday":431,"iphone":432,"line":433,"ios":434,"operating":435,"system":436,"includes":437,"pro":438,"air":439,"16e":440,"mac":441,"macos":442,"laptops":443,"macbook":444,"desktops":445,"imac":446,"mini":447,"studio":448,"ipad":449,"multipurpose":450,"ipados":451,"smartwatches":452,"wireless":453,"headphones":454,"spatial":455,"watchos":456,"watch":457,"series":458,"se":459,"ultra":460,"airpods":461,"max":462,"beats":463,"products":464,"vision":465,"computer":466,"visionos":467,"home":468,"tv":469,"4k":470,"media":471,"streaming":472,"gaming":473,"device":474,"tvos":475,"homepod":476,"high":477,"fidelity":478,"smart":479,"speakers":480,"branded":481,"third":482,"party":483,"advertising":484,"licensing":485,"arrangements":486,"own":487,"platforms":488,"offers":489,"portfolio":490,"fee":491,"service":492,"support":493,"applecare":494,"brand":495,"offerings":496,"priority":497,"access":498,"technical":499,"global":500,"authorized":501,"network":502,"repair":503,"replacement":504,"cases":505,"additional":506,"coverage":507,"instances":508,"accidental":509,"damage":510,"theft":511,"loss":512,"depending":513,"country":514,"type":515,"product":516,"cloud":517,"store":518,"keep":519,"customers":520,"content":521,"up":522,"available":523,"across":524,"multiple":525,"devices":526,"windows":527,"operates":528,"various":529,"app":530,"allow":531,"discover":532,"download":533,"applications":534,"digital":535,"books":536,"music":537,"video":538,"games":539,"podcasts":540,"through":541,"subscription":542,"arcade":543,"game":544,"fitness":545,"personalized":546,"users":547,"curated":548,"listening":549,"experience":550,"demand":551,"radio":552,"stations":553,"news":554,"magazine":555,"exclusive":556,"original":557,"live":558,"sports":559,"payment":560,"card":561,"co":562,"credit":563,"pay":564,"cashless":565,"manages":566,"primarily":567,"geographic":568,"basis":569,"reportable":570,"segments":571,"consist":572,"americas":573,"europe":574,"greater":575,"china":576,"japan":577,"rest":578,"asia":579,"pacific":580,"both":581,"north":582,"south":583,"america":584,"european":585,"countries":586,"india":587,"middle":588,"east":589,"africa":590,"mainland":591,"hong":592,"kong":593,"taiwan":594,"australia":595,"zealand":596,"asian":597,"although":598,"hardware":599,"software":600,"managed":601,"separately":602,"better":603,"align":604,"location":605,"distribution":606,"partners":607,"unique":608,"dynamics":609,"region":610,"consumer":611,"small":612,"mid":613,"sized":614,"education":615,"enterprise":616,"government":617,"resells":618,"major":619,"retail":620,"online":621,"stores":622,"direct":623,"sales":624,"force":625,"same":626,"employs":627,"indirect":628,"channels":629,"cellular":630,"carriers":631,"resellers":632,"sale":633,"net":634,"accounted":635,"40":636,"60":637,"respectively":638,"total":639,"highly":640,"competitive":641,"characterized":642,"aggressive":643,"price":644,"competition":645,"downward":646,"pressure":647,"gross":648,"margins":649,"continual":650,"improvement":651,"sensitivity":652,"consumers":653,"businesses":654,"competes":655,"further":656,"frequent":657,"introduction":658,"short":659,"life":660,"cycles":661,"evolving":662,"industry":663,"rapid":664,"adoption":665,"technological":666,"advancements":667,"competitors":668,"seek":669,"compete":670,"pricing":671,"very":672,"low":673,"cost":674,"structures":675,"imitating":676,"infringing":677,"intellectual":678,"property":679,"ability":680,"successfully":681,"depends":682,"heavily":683,"ensuring":684,"continuing":685,"timely":686,"innovative":687,"technologies":688,"marketplace":689,"develops":690,"nearly":691,"entire":692,"solution":693,"numerous":694,"important":695,"features":696,"relative":697,"quality":698,"reliability":699,"design":700,"technology":701,"innovation":702,"strong":703,"ecosystem":704,"marketing":705,"capability":706,"reputation":707,"effectively":708,"protect":709,"enforce":710,"rights":711,"focused":712,"expanding":713,"opportunities":714,"face":715,"substantial":716,"companies":717,"significant":718,"resources":719,"established":720,"customer":721,"bases":722,"addition":723,"faces":724,"imitate":725,"offer":726,"more":727,"solutions":728,"intensify":729,"approach":730,"providing":731,"components":732,"seamlessly":733,"work":734,"collaboratively":735,"integrated":736,"some":737,"broad":738,"lines":739,"priced":740,"installed":741,"active":742,"particularly":743,"intense":744,"aggressively":745,"cut":746,"prices":747,"lowered":748,"little":749,"profit":750,"even":751,"minority":752,"smartphone":753,"tablet":754,"time":755,"experienced":756,"contracted":757,"overall":758,"essential":759,"generally":760,"sources":761,"currently":762,"obtained":763,"single":764,"participants":765,"therefore":766,"times":767,"wide":768,"shortage":769,"commodity":770,"fluctuations":771,"restrictions":772,"international":773,"trade":774,"increase":775,"limit":776,"availability":777,"rare":778,"earths":779,"raw":780,"materials":781,"go":782,"them":783,"uses":784,"custom":785,"commonly":786,"introduced":787,"often":788,"utilize":789,"only":790,"source":791,"when":792,"component":793,"initial":794,"capacity":795,"constraints":796,"exist":797,"until":798,"suppliers":799,"yields":800,"matured":801,"manufacturing":802,"capacities":803,"increased":804,"entered":805,"agreements":806,"supply":807,"however":808,"able":809,"extend":810,"renew":811,"successful":812,"obtaining":813,"sufficient":814,"quantities":815,"manner":816,"identifying":817,"alternative":818,"fail":819,"consolidation":820,"decide":821,"concentrate":822,"production":823,"instead":824,"customized":825,"meet":826,"limiting":827,"obtain":828,"commercially":829,"reasonable":830,"industries":831,"advances":832,"upon":833,"ensure":834,"flow":835,"continues":836,"develop":837,"enhance":838,"existing":839,"expand":840,"range":841,"research":842,"development":843,"acquisition":844,"holds":845,"collection":846,"aspects":847,"patents":848,"copyrights":849,"trademarks":850,"secrets":851,"forms":852,"factor":853,"differentiating":854,"success":855,"depend":856,"relies":857,"skills":858,"competence":859,"abilities":860,"personnel":861,"regularly":862,"patent":863,"copyright":864,"trademark":865,"innovations":866,"arising":867,"pursuing":868,"thousands":869,"around":870,"world":871,"accumulated":872,"right":873,"responsible":874,"protecting":875,"duration":876,"adequate":877,"expected":878,"lives":879,"must":880,"licensed":881,"parties":882,"necessary":883,"licenses":884,"processes":885,"while":886,"guarantee":887,"historically":888,"higher":889,"first":890,"compared":891,"seasonal":892,"holiday":893,"additionally":894,"introductions":895,"expenses":896,"timing":897,"filled":898,"inventory":899,"following":900,"launch":901,"channel":902,"older":903,"declines":904,"newer":905,"approaches":906,"affected":907,"distributors":908,"anticipate":909,"people":910,"play":911,"role":912,"strives":913,"attract":914,"retain":915,"best":916,"talent":917,"works":918,"create":919,"culture":920,"collaboration":921,"backgrounds":922,"perspectives":923,"come":924,"together":925,"innovate":926,"do":927,"equal":928,"opportunity":929,"committed":930,"inclusion":931,"workplace":932,"free":933,"harassment":934,"discrimination":935,"had":936,"166":937,"full":938,"equivalent":939,"employees":940,"should":941,"equitable":942,"discretionary":943,"cash":944,"awards":945,"enable":946,"recognizes":947,"likely":948,"thrive":949,"needs":950,"succeed":951,"professional":952,"benefits":953,"health":954,"wellness":955,"away":956,"invests":957,"help":958,"achieve":959,"career":960,"goals":961,"programs":962,"university":963,"leadership":964,"influence":965,"values":966,"team":967,"members":968,"take":969,"advantage":970,"classes":971,"open":972,"honest":973,"communication":974,"among":975,"managers":976,"leaders":977,"helps":978,"collaborative":979,"environment":980,"everyone":981,"contribute":982,"grow":983,"encouraged":984,"questions":985,"feedback":986,"concerns":987,"conducts":988,"surveys":989,"gauge":990,"employee":991,"sentiment":992,"areas":993,"like":994,"manager":995,"everywhere":996,"supports":997,"general":998,"crisis":999,"training":1000,"putting":1001,"specific":1002,"place":1003,"working":1004,"potentially":1005,"hazard":1006,"environments":1007,"quarterly":1008,"amendments":1009,"sections":1010,"amended":1011,"sec":1012,"charge":1013,"investor":1014,"com":1015,"relations":1016,"filings":1017,"default":1018,"aspx":1019,"website":1020,"periodically":1021,"provides":1022,"investors":1023,"www":1024,"press":1025,"releases":1026,"details":1027,"contained":1028,"websites":1029,"referenced":1030,"urls":1031,"intended":1032,"inactive":1033,"textual":1034,"summarizes":1035,"material":1036,"adverse":1037,"effect":1038,"accurately":1039,"predict":1040,"mitigate":1041,"beliefs":1042,"opinions":1043,"materially":1044,"adversely":1045,"affect":1046,"representations":1047,"occurred":1048,"described":1049,"below":1050,"exhaustive":1051,"considered":1052,"complete":1053,"read":1054,"conjunction":1055,"consolidated":1056,"accompanying":1057,"outside":1058,"representing":1059,"majority":1060,"chain":1061,"complex":1062,"supplier":1063,"facilities":1064,"assembly":1065,"sites":1066,"result":1067,"regional":1068,"economic":1069,"slow":1070,"recession":1071,"unemployment":1072,"inflation":1073,"tighter":1074,"interest":1075,"rates":1076,"currency":1077,"confidence":1078,"spending":1079,"response":1080,"monetary":1081,"policy":1082,"volatility":1083,"income":1084,"asset":1085,"uncertainty":1086,"decline":1087,"contract":1088,"manufacturers":1089,"logistics":1090,"providers":1091,"developers":1092,"outcomes":1093,"instability":1094,"inability":1095,"finance":1096,"insolvency":1097,"lead":1098,"collectibility":1099,"receivables":1100,"failure":1101,"derivative":1102,"counterparties":1103,"institutions":1104,"limitations":1105,"issue":1106,"debt":1107,"reduced":1108,"liquidity":1109,"fair":1110,"instruments":1111,"impacts":1112,"political":1113,"disputes":1114,"geopolitical":1115,"tensions":1116,"conflict":1117,"terrorism":1118,"natural":1119,"disasters":1120,"issues":1121,"industrial":1122,"accidents":1123,"interruptions":1124,"performed":1125,"whole":1126,"outsourcing":1127,"korea":1128,"vietnam":1129,"sourcing":1130,"imports":1131,"exports":1132,"goods":1133,"restrictive":1134,"apply":1135,"regions":1136,"derives":1137,"portion":1138,"revenues":1139,"require":1140,"change":1141,"restructure":1142,"refrain":1143,"offering":1144,"distributing":1145,"cease":1146,"distribute":1147,"changing":1148,"accordance":1149,"changed":1150,"expensive":1151,"consuming":1152,"disruptive":1153,"shifts":1154,"reductions":1155,"negative":1156,"announced":1157,"advance":1158,"notice":1159,"chains":1160,"concentrated":1161,"escalation":1162,"disruptions":1163,"beginning":1164,"union":1165,"eu":1166,"others":1167,"several":1168,"imposed":1169,"threatened":1170,"impose":1171,"reciprocal":1172,"retaliatory":1173,"modifications":1174,"made":1175,"sector":1176,"department":1177,"commerce":1178,"initiated":1179,"investigation":1180,"expansion":1181,"1962":1182,"things":1183,"semiconductors":1184,"semiconductor":1185,"equipment":1186,"downstream":1187,"contain":1188,"ultimate":1189,"remains":1190,"uncertain":1191,"incremental":1192,"what":1193,"extent":1194,"implement":1195,"magnitude":1196,"conflicts":1197,"escalate":1198,"actions":1199,"governments":1200,"severe":1201,"critical":1202,"locations":1203,"prone":1204,"earthquakes":1205,"climate":1206,"resulting":1207,"types":1208,"extreme":1209,"weather":1210,"occurring":1211,"frequently":1212,"effects":1213,"interruption":1214,"fire":1215,"power":1216,"shortages":1217,"nuclear":1218,"plant":1219,"terrorist":1220,"attacks":1221,"hostile":1222,"acts":1223,"ransomware":1224,"labor":1225,"beyond":1226,"make":1227,"difficult":1228,"impossible":1229,"manufacture":1230,"deliver":1231,"delays":1232,"inefficiencies":1233,"slowdowns":1234,"outages":1235,"costs":1236,"negatively":1237,"maintain":1238,"safe":1239,"accident":1240,"occur":1241,"serious":1242,"injuries":1243,"disruption":1244,"harm":1245,"pandemics":1246,"covid":1247,"pandemic":1248,"economy":1249,"imposition":1250,"protective":1251,"stringent":1252,"travel":1253,"freight":1254,"movement":1255,"between":1256,"ramps":1257,"incur":1258,"expenditures":1259,"resume":1260,"lose":1261,"affecting":1262,"exacerbate":1263,"consequences":1264,"maintains":1265,"insurance":1266,"losses":1267,"insufficient":1268,"cover":1269,"arise":1270,"foregoing":1271,"offered":1272,"investments":1273,"returns":1274,"effective":1275,"protection":1276,"enforcement":1277,"regulatory":1278,"investigations":1279,"withdraw":1280,"modify":1281,"derive":1282,"enjoin":1283,"using":1284,"applied":1285,"register":1286,"contrast":1287,"consistently":1288,"unable":1289,"continue":1290,"sell":1291,"attractive":1292,"infringe":1293,"volatile":1294,"nature":1295,"continually":1296,"introduce":1297,"stimulate":1298,"upgraded":1299,"navigate":1300,"barriers":1301,"manage":1302,"recruit":1303,"skilled":1304,"execute":1305,"strategic":1306,"initiatives":1307,"acceptance":1308,"ramp":1309,"integration":1310,"delivery":1311,"application":1312,"purchase":1313,"commitments":1314,"levels":1315,"anticipated":1316,"appropriate":1317,"defects":1318,"deficiencies":1319,"replace":1320,"supersede":1321,"produce":1322,"lower":1323,"transitions":1324,"final":1325,"substantially":1326,"outsourced":1327,"much":1328,"transportation":1329,"reduce":1330,"diminished":1331,"quantity":1332,"manufactured":1333,"flexibility":1334,"respond":1335,"provisions":1336,"defect":1337,"expense":1338,"reimbursement":1339,"warranty":1340,"out":1341,"event":1342,"experiences":1343,"unanticipated":1344,"liabilities":1345,"adhere":1346,"conduct":1347,"violations":1348,"additions":1349,"considerable":1350,"exposure":1351,"operational":1352,"obtains":1353,"increases":1354,"sophisticated":1355,"unexpectedly":1356,"interfere":1357,"operation":1358,"unsafe":1359,"environmental":1360,"injury":1361,"specialized":1362,"errors":1363,"artificial":1364,"intelligence":1365,"exposing":1366,"harmful":1367,"inaccurate":1368,"detect":1369,"fix":1370,"widespread":1371,"bugs":1372,"vulnerabilities":1373,"exploited":1374,"compromising":1375,"user":1376,"exposed":1377,"liability":1378,"claims":1379,"recalls":1380,"replacements":1381,"write":1382,"offs":1383,"intangible":1384,"assets":1385,"fines":1386,"problems":1387,"poor":1388,"delay":1389,"lost":1390,"records":1391,"down":1392,"inventories":1393,"exceeds":1394,"realizable":1395,"reviews":1396,"capital":1397,"prepayments":1398,"long":1399,"lived":1400,"impairment":1401,"whenever":1402,"circumstances":1403,"recoverable":1404,"writedowns":1405,"impairments":1406,"charges":1407,"given":1408,"unpredictable":1409,"pace":1410,"obsolescence":1411,"orders":1412,"builds":1413,"announcements":1414,"shipments":1415,"obligations":1416,"forecasted":1417,"typically":1418,"150":1419,"forecast":1420,"incorrectly":1421,"order":1422,"excess":1423,"amounts":1424,"fully":1425,"accrues":1426,"cancellation":1427,"reserves":1428,"extensive":1429,"rate":1430,"generation":1431,"alleged":1432,"exacerbated":1433,"machine":1434,"learning":1435,"copyrighted":1436,"reproduction":1437,"outputs":1438,"notified":1439,"always":1440,"preclude":1441,"selling":1442,"expose":1443,"decisions":1444,"discontinue":1445,"maintenance":1446,"developed":1447,"maintained":1448,"choose":1449,"buy":1450,"impacting":1451,"developer":1452,"perceived":1453,"creating":1454,"android":1455,"playstation":1456,"nintendo":1457,"xbox":1458,"position":1459,"revenue":1460,"generated":1461,"developing":1462,"less":1463,"inclined":1464,"upgrade":1465,"devote":1466,"upgrading":1467,"larger":1468,"focus":1469,"efforts":1470,"competing":1471,"suffer":1472,"continued":1473,"compelling":1474,"systems":1475,"improved":1476,"operate":1477,"dissatisfied":1478,"contracts":1479,"subscriptions":1480,"incorporate":1481,"relatively":1482,"continuation":1483,"renewal":1484,"license":1485,"acceptable":1486,"usage":1487,"rules":1488,"produces":1489,"costly":1490,"increasing":1491,"subscribers":1492,"appeal":1493,"talents":1494,"key":1495,"chief":1496,"officer":1497,"especially":1498,"silicon":1499,"valley":1500,"fields":1501,"seeks":1502,"workforce":1503,"constantly":1504,"laws":1505,"regulations":1506,"immigration":1507,"employment":1508,"export":1509,"strategy":1510,"distinctive":1511,"inclusive":1512,"driver":1513,"nurture":1514,"who":1515,"distributes":1516,"financing":1517,"installment":1518,"subsidies":1519,"discontinued":1520,"modified":1521,"invested":1522,"invest":1523,"reseller":1524,"staffing":1525,"selected":1526,"contractors":1527,"improving":1528,"placement":1529,"displays":1530,"making":1531,"investment":1532,"assuring":1533,"return":1534,"purchasing":1535,"preferences":1536,"behaviors":1537,"weaken":1538,"stop":1539,"ordering":1540,"dependent":1541,"failures":1542,"caused":1543,"telecommunications":1544,"war":1545,"viruses":1546,"physical":1547,"electronic":1548,"break":1549,"ins":1550,"incidents":1551,"upgrades":1552,"redundancy":1553,"continuity":1554,"ineffective":1555,"inadequate":1556,"vendors":1557,"disaster":1558,"planning":1559,"eventualities":1560,"preventing":1561,"interfering":1562,"impeding":1563,"shipping":1564,"requires":1565,"confidential":1566,"sensitive":1567,"respect":1568,"devotes":1569,"encryption":1570,"cannot":1571,"absolute":1572,"unauthorized":1573,"malicious":1574,"disrupt":1575,"takes":1576,"steps":1577,"secure":1578,"accessible":1579,"behalf":1580,"attempts":1581,"gain":1582,"regular":1583,"target":1584,"confidentiality":1585,"integrity":1586,"normal":1587,"impair":1588,"commercial":1589,"penalties":1590,"judgments":1591,"globally":1592,"accelerating":1593,"frequency":1594,"sophistication":1595,"actors":1596,"tools":1597,"techniques":1598,"designed":1599,"circumvent":1600,"avoid":1601,"detection":1602,"remove":1603,"obfuscate":1604,"forensic":1605,"evidence":1606,"hinders":1607,"identify":1608,"investigate":1609,"recover":1610,"against":1611,"perpetrated":1612,"being":1613,"targeted":1614,"profile":1615,"creates":1616,"owns":1617,"implemented":1618,"vulnerable":1619,"hacking":1620,"malfeasance":1621,"faulty":1622,"password":1623,"irregularities":1624,"fraudulently":1625,"induce":1626,"disclosing":1627,"usernames":1628,"passwords":1629,"turn":1630,"deploys":1631,"makes":1632,"multifactor":1633,"authentication":1634,"monitors":1635,"unusual":1636,"activity":1637,"freeze":1638,"accounts":1639,"suspicious":1640,"impede":1641,"strategies":1642,"acquisitions":1643,"endeavors":1644,"distraction":1645,"than":1646,"challenges":1647,"tangible":1648,"failing":1649,"approvals":1650,"counterparty":1651,"perform":1652,"onerous":1653,"completing":1654,"transaction":1655,"realize":1656,"ventures":1657,"inherently":1658,"risky":1659,"arisen":1660,"ordinary":1661,"course":1662,"yet":1663,"resolved":1664,"enters":1665,"indemnification":1666,"damages":1667,"claim":1668,"indemnified":1669,"involving":1670,"faced":1671,"enabled":1672,"frameworks":1673,"holding":1674,"assert":1675,"royalties":1676,"enter":1677,"allegations":1678,"infringement":1679,"novel":1680,"attempted":1681,"vigorously":1682,"defending":1683,"courts":1684,"internationally":1685,"plaintiffs":1686,"injunctive":1687,"relief":1688,"regardless":1689,"merit":1690,"responding":1691,"recognition":1692,"considerations":1693,"settle":1694,"resolve":1695,"still":1696,"practices":1697,"outcome":1698,"above":1699,"disgorgement":1700,"profits":1701,"remedial":1702,"resolution":1703,"import":1704,"worldwide":1705,"subjects":1706,"antitrust":1707,"privacy":1708,"localization":1709,"age":1710,"verification":1711,"billing":1712,"internet":1713,"mobile":1714,"communications":1715,"television":1716,"film":1717,"anticorruption":1718,"repatriation":1719,"anti":1720,"money":1721,"laundering":1722,"national":1723,"tax":1724,"waste":1725,"recycling":1726,"compliance":1727,"directives":1728,"priorities":1729,"feature":1730,"imposing":1731,"requiring":1732,"how":1733,"interpreted":1734,"found":1735,"violated":1736,"expands":1737,"ethical":1738,"policies":1739,"violation":1740,"banned":1741,"delayed":1742,"prohibited":1743,"importation":1744,"stakeholders":1745,"regulators":1746,"differing":1747,"social":1748,"societal":1749,"pursues":1750,"comply":1751,"varied":1752,"conflicting":1753,"federal":1754,"so":1755,"reactions":1756,"commencement":1757,"taken":1758,"communicate":1759,"apps":1760,"storefront":1761,"mechanisms":1762,"court":1763,"adopted":1764,"adopt":1765,"wideranging":1766,"safari":1767,"dma":1768,"methods":1769,"processing":1770,"programming":1771,"interfaces":1772,"plan":1773,"engagement":1774,"challenged":1775,"litigants":1776,"noncompliance":1777,"poses":1778,"remain":1779,"individually":1780,"civil":1781,"lawsuits":1782,"alleging":1783,"monopolization":1784,"become":1785,"earns":1786,"google":1787,"search":1788,"august":1789,"2024":1790,"connection":1791,"finding":1792,"district":1793,"columbia":1794,"ordered":1795,"remedies":1796,"before":1797,"interpretation":1798,"justice":1799,"doj":1800,"reversal":1801,"initially":1802,"proposed":1803,"prohibiting":1804,"earn":1805,"retention":1806,"transfer":1807,"restrict":1808,"transfers":1809,"passed":1810,"considering":1811,"pending":1812,"inconsistent":1813,"causes":1814,"notices":1815,"inquiries":1816,"governmental":1817,"entities":1818,"reputational":1819,"ongoing":1820,"inadvertent":1821,"exacerbating":1822,"minors":1823,"applicable":1824,"biometric":1825,"breach":1826,"notification":1827,"authorities":1828,"fails":1829,"adequately":1830,"liable":1831,"investigatory":1832,"enhanced":1833,"protections":1834,"mandatory":1835,"heightened":1836,"vary":1837,"pressures":1838,"compressed":1839,"acquiring":1840,"delivering":1841,"mix":1842,"generates":1843,"category":1844,"primary":1845,"movements":1846,"dollar":1847,"denominated":1848,"weakening":1849,"currencies":1850,"affects":1851,"earnings":1852,"leads":1853,"raise":1854,"reducing":1855,"reasons":1856,"offset":1857,"strengthening":1858,"conversely":1859,"thereby":1860,"benefit":1861,"thus":1862,"option":1863,"hedge":1864,"exposures":1865,"hedging":1866,"activities":1867,"unfavorable":1868,"hedges":1869,"deterioration":1870,"sovereign":1871,"equivalents":1872,"marketable":1873,"fluctuate":1874,"realized":1875,"covered":1876,"collateral":1877,"bank":1878,"unsecured":1879,"vendor":1880,"nontrade":1881,"subassemblies":1882,"assemble":1883,"term":1884,"few":1885,"individual":1886,"monitor":1887,"taxes":1888,"ireland":1889,"singapore":1890,"organized":1891,"organisation":1892,"proposals":1893,"modernizing":1894,"minimum":1895,"statutory":1896,"valuation":1897,"deferred":1898,"judgment":1899,"interpretations":1900,"examination":1901,"bodies":1902,"assesses":1903,"likelihood":1904,"examinations":1905,"determine":1906,"adequacy":1907,"provision":1908,"owed":1909,"amount":1910,"accrued":1911,"volume":1912,"ways":1913,"unrelated":1914,"average":1915,"repurchases":1916,"exceed":1917,"point":1918,"profitability":1919,"dividend":1920,"repurchase":1921,"program":1922,"consummated":1923,"dividends":1924,"declaration":1925,"board":1926,"obligate":1927,"acquire":1928,"led":1929,"head":1930,"responsibility":1931,"assessing":1932,"managing":1933,"threats":1934,"dedicated":1935,"individuals":1936,"engages":1937,"implements":1938,"posture":1939,"responds":1940,"executes":1941,"testing":1942,"assessments":1943,"knowledge":1944,"gained":1945,"25":1946,"serving":1947,"positions":1948,"leading":1949,"since":1950,"2016":1951,"coordinates":1952,"teams":1953,"assess":1954,"test":1955,"assist":1956,"incident":1957,"trust":1958,"log":1959,"track":1960,"senior":1961,"committee":1962,"reflects":1963,"assists":1964,"oversight":1965,"monitoring":1966,"discusses":1967,"counsel":1968,"heads":1969,"assurance":1970,"receives":1971,"updates":1972,"chair":1973,"substance":1974,"discussions":1975,"recommends":1976,"deems":1977,"headquarters":1978,"leased":1979,"land":1980,"functions":1981,"centers":1982,"throughout":1983,"places":1984,"good":1985,"suitable":1986,"opened":1987,"formal":1988,"article":1989,"promote":1990,"distributed":1991,"conclude":1992,"june":1993,"24":1994,"contractual":1995,"marketplaces":1996,"violate":1997,"april":1998,"23":1999,"fined":2000,"million":2001,"desist":2002,"steering":2003,"appealed":2004,"decision":2005,"preliminary":2006,"findings":2007,"complies":2008,"attorneys":2009,"lawsuit":2010,"jersey":2011,"seeking":2012,"redress":2013,"anticompetitive":2014,"behavior":2015,"nonmonetary":2016,"defenses":2017,"defend":2018,"itself":2019,"epic":2020,"northern":2021,"unfair":2022,"review":2023,"guidelines":2024,"injunction":2025,"2021":2026,"enjoining":2027,"buttons":2028,"external":2029,"links":2030,"calls":2031,"action":2032,"applies":2033,"storefronts":2034,"january":2035,"30":2036,"motion":2037,"narrow":2038,"vacate":2039,"enjoined":2040,"restricting":2041,"conditioning":2042,"guide":2043,"choice":2044,"proceed":2045,"denied":2046,"referred":2047,"attorney":2048,"criminal":2049,"contempt":2050,"recent":2051,"appeals":2052,"ninth":2053,"circuit":2054,"request":2055,"stay":2056,"agreed":2057,"consider":2058,"expedited":2059,"oral":2060,"arguments":2061,"heard":2062,"settled":2063,"fourth":2064,"did":2065,"traded":2066,"22":2067,"429":2068,"record":2069,"three":2070,"follows":2071,"millions":2072,"reflected":2073,"purchased":2074,"paid":2075,"publicly":2076,"approximate":2077,"29":2078,"privately":2079,"negotiated":2080,"33":2081,"265":2082,"210":2083,"43":2084,"986":2085,"224":2086,"31":2087,"247":2088,"238":2089,"56":2090,"89":2091,"498":2092,"99":2093,"779":2094,"110":2095,"billion":2096,"utilized":2097,"100":2098,"221":2099,"repurchased":2100,"10b5":2101,"graph":2102,"shows":2103,"comparison":2104,"five":2105,"cumulative":2106,"shareholder":2107,"calculated":2108,"reinvested":2109,"index":2110,"dow":2111,"jones":2112,"close":2113,"2020":2114,"indicative":2115,"510":2116,"339":2117,"start":2118,"text":2119,"300":2120,"200":2121,"2022":2122,"2023":2123,"208":2124,"234":2125,"132":2126,"136":2127,"155":2128,"137":2129,"115":2130,"185":2131,"217":2132,"147":2133,"107":2134,"220":2135,"287":2136,"_the":2137,"items":2138,"comparisons":2139,"announces":2140,"26":2141,"tahoe":2142,"six":2143,"realign":2144,"spanned":2145,"weeks":2146,"whereas":2147,"indirectly":2148,"impacted":2149,"margin":2150,"table":2151,"segment":2152,"dollars":2153,"162":2154,"560":2155,"178":2156,"167":2157,"045":2158,"111":2159,"032":2160,"101":2161,"328":2162,"294":2163,"64":2164,"377":2165,"66":2166,"952":2167,"72":2168,"559":2169,"703":2170,"052":2171,"257":2172,"696":2173,"658":2174,"615":2175,"416":2176,"161":2177,"391":2178,"035":2179,"383":2180,"285":2181,"weakness":2182,"decreased":2183,"partially":2184,"583":2185,"209":2186,"586":2187,"201":2188,"183":2189,"708":2190,"984":2191,"357":2192,"023":2193,"694":2194,"686":2195,"37":2196,"005":2197,"39":2198,"845":2199,"109":2200,"158":2201,"96":2202,"169":2203,"85":2204,"amortization":2205,"bundled":2206,"models":2207,"percentage":2208,"112":2209,"887":2210,"633":2211,"108":2212,"803":2213,"82":2214,"314":2215,"71":2216,"345":2217,"195":2218,"180":2219,"683":2220,"148":2221,"36":2222,"75":2223,"73":2224,"70":2225,"46":2226,"44":2227,"favorable":2228,"different":2229,"tariff":2230,"915":2231,"34":2232,"550":2233,"370":2234,"administrative":2235,"601":2236,"097":2237,"932":2238,"62":2239,"151":2240,"467":2241,"847":2242,"driven":2243,"headcount":2244,"infrastructure":2245,"variable":2246,"749":2247,"741":2248,"719":2249,"unrecognized":2250,"allowance":2251,"decrease":2252,"aid":2253,"note":2254,"balances":2255,"totaled":2256,"along":2257,"satisfy":2258,"next":2259,"fixed":2260,"varying":2261,"maturities":2262,"91":2263,"payable":2264,"payments":2265,"promissory":2266,"paper":2267,"lease":2268,"center":2269,"space":2270,"utilizes":2271,"finished":2272,"55":2273,"noncancelable":2274,"balance":2275,"cuts":2276,"jobs":2277,"2017":2278,"tcja":2279,"raised":2280,"fasb":2281,"asu":2282,"06":2283,"_intangibles":2284,"goodwill":2285,"subtopic":2286,"350":2287,"improvements":2288,"software_":2289,"modernizes":2290,"removes":2291,"stages":2292,"capitalization":2293,"project":2294,"probable":2295,"early":2296,"permitted":2297,"evaluating":2298,"method":2299,"november":2300,"03":2301,"_income":2302,"comprehensive":2303,"disaggregation":2304,"expenses_":2305,"01":2306,"clarifying":2307,"date_":2308,"clarified":2309,"disclose":2310,"depreciation":2311,"captions":2312,"qualitatively":2313,"describe":2314,"remaining":2315,"definition":2316,"2028":2317,"prospective":2318,"december":2319,"09":2320,"topic":2321,"740":2322,"disclosures_":2323,"reconciliation":2324,"reconciling":2325,"threshold":2326,"disaggregate":2327,"preparation":2328,"conformity":2329,"accepted":2330,"principles":2331,"gaap":2332,"reported":2333,"describes":2334,"carrying":2335,"evaluation":2336,"involves":2337,"domestic":2338,"allocation":2339,"taxation":2340,"adjusted":2341,"facts":2342,"closing":2343,"incurred":2344,"reasonably":2345,"estimable":2346,"portfolios":2347,"sets":2348,"forth":2349,"derivatives":2350,"hypothetical":2351,"instrument":2352,"755":2353,"points":2354,"tenors":2355,"129":2356,"139":2357,"receiver":2358,"expressed":2359,"adjust":2360,"local":2361,"prohibitive":2362,"var":2363,"model":2364,"monte":2365,"carlo":2366,"simulation":2367,"maximum":2368,"interval":2369,"95":2370,"590":2371,"538":2372,"underlying":2373,"sheets":2374,"32":2375,"flows":2376,"independent":2377,"49":2378,"present":2379,"submission":2380,"schedule":2381,"307":2382,"003":2383,"866":2384,"298":2385,"085":2386,"194":2387,"116":2388,"233":2389,"189":2390,"282":2391,"844":2392,"119":2393,"855":2394,"960":2395,"352":2396,"214":2397,"133":2398,"123":2399,"216":2400,"114":2401,"301":2402,"321":2403,"269":2404,"565":2405,"729":2406,"485":2407,"113":2408,"736":2409,"010":2410,"93":2411,"995":2412,"basic":2413,"diluted":2414,"08":2415,"computing":2416,"948":2417,"343":2418,"783":2419,"744":2420,"231":2421,"004":2422,"697":2423,"095":2424,"812":2425,"547":2426,"translation":2427,"267":2428,"395":2429,"765":2430,"unrealized":2431,"gains":2432,"849":2433,"832":2434,"323":2435,"adjustment":2436,"212":2437,"337":2438,"717":2439,"637":2440,"394":2441,"817":2442,"850":2443,"563":2444,"414":2445,"204":2446,"054":2447,"816":2448,"280":2449,"611":2450,"98":2451,"016":2452,"652":2453,"934":2454,"943":2455,"763":2456,"228":2457,"receivable":2458,"777":2459,"410":2460,"833":2461,"718":2462,"286":2463,"585":2464,"957":2465,"152":2466,"987":2467,"77":2468,"723":2469,"479":2470,"834":2471,"45":2472,"680":2473,"83":2474,"727":2475,"74":2476,"211":2477,"284":2478,"993":2479,"359":2480,"241":2481,"364":2482,"980":2483,"69":2484,"860":2485,"68":2486,"387":2487,"78":2488,"304":2489,"055":2490,"249":2491,"979":2492,"967":2493,"912":2494,"165":2495,"631":2496,"176":2497,"392":2498,"750":2499,"41":2500,"549":2501,"888":2502,"877":2503,"131":2504,"638":2505,"508":2506,"308":2507,"030":2508,"contingencies":2509,"50":2510,"400":2511,"773":2512,"260":2513,"786":2514,"568":2515,"276":2516,"deficit":2517,"264":2518,"154":2519,"571":2520,"172":2521,"733":2522,"950":2523,"146":2524,"672":2525,"423":2526,"346":2527,"withheld":2528,"settlement":2529,"452":2530,"521":2531,"246":2532,"034":2533,"138":2534,"ending":2535,"068":2536,"declared":2537,"413":2538,"218":2539,"655":2540,"612":2541,"099":2542,"846":2543,"046":2544,"rsu":2545,"02":2546,"restricted":2547,"737":2548,"977":2549,"adjustments":2550,"reconcile":2551,"698":2552,"445":2553,"519":2554,"863":2555,"688":2556,"266":2557,"227":2558,"682":2559,"788":2560,"347":2561,"356":2562,"271":2563,"618":2564,"197":2565,"731":2566,"684":2567,"902":2568,"020":2569,"889":2570,"076":2571,"552":2572,"031":2573,"482":2574,"118":2575,"254":2576,"543":2577,"investing":2578,"407":2579,"48":2580,"656":2581,"513":2582,"proceeds":2583,"907":2584,"51":2585,"890":2586,"135":2587,"828":2588,"715":2589,"447":2590,"959":2591,"480":2592,"935":2593,"705":2594,"441":2595,"421":2596,"025":2597,"711":2598,"949":2599,"issuance":2600,"481":2601,"repayments":2602,"958":2603,"978":2604,"361":2605,"581":2606,"121":2607,"983":2608,"488":2609,"991":2610,"794":2611,"760":2612,"supplemental":2613,"369":2614,"102":2615,"679":2616,"prior":2617,"reclassified":2618,"conform":2619,"presentation":2620,"07":2621,"_segment":2622,"maker":2623,"codm":2624,"deciding":2625,"allocate":2626,"retrospective":2627,"collected":2628,"remitted":2629,"straight":2630,"estimate":2631,"ultimately":2632,"vest":2633,"liquid":2634,"treated":2635,"sold":2636,"determined":2637,"measured":2638,"recognized":2639,"presents":2640,"created":2641,"combines":2642,"nonlease":2643,"leases":2644,"entitled":2645,"transferred":2646,"rewards":2647,"shipped":2648,"delivered":2649,"represent":2650,"promises":2651,"arrangement":2652,"distinct":2653,"allocates":2654,"stand":2655,"alone":2656,"ssps":2657,"observable":2658,"process":2659,"estimating":2660,"without":2661,"considers":2662,"charged":2663,"trends":2664,"objectives":2665,"estimated":2666,"represents":2667,"allocated":2668,"receive":2669,"icloud":2670,"siri":2671,"maps":2672,"discounts":2673,"lacks":2674,"occurs":2675,"bill":2676,"undelivered":2677,"unbilled":2678,"consideration":2679,"entirely":2680,"accordingly":2681,"transferring":2682,"billed":2683,"determining":2684,"establish":2685,"retains":2686,"acceptability":2687,"recognizing":2688,"disaggregated":2689,"229":2690,"728":2691,"proportion":2692,"consistent":2693,"represented":2694,"moderately":2695,"two":2696,"computation":2697,"numerator":2698,"denominator":2699,"weighted":2700,"dilutive":2701,"312":2702,"316":2703,"units":2704,"rsus":2705,"antidilutive":2706,"tables":2707,"show":2708,"level":2709,"funds":2710,"272":2711,"mutual":2712,"177":2713,"854":2714,"subtotal":2715,"951":2716,"126":2717,"treasury":2718,"074":2719,"848":2720,"190":2721,"712":2722,"946":2723,"agency":2724,"149":2725,"251":2726,"456":2727,"424":2728,"273":2729,"418":2730,"certificates":2731,"deposit":2732,"deposits":2733,"917":2734,"904":2735,"47":2736,"916":2737,"623":2738,"937":2739,"municipal":2740,"207":2741,"205":2742,"86":2743,"mortgage":2744,"backed":2745,"130":2746,"252":2747,"910":2748,"493":2749,"027":2750,"909":2751,"134":2752,"420":2753,"199":2754,"778":2755,"515":2756,"105":2757,"617":2758,"293":2759,"516":2760,"087":2761,"380":2762,"159":2763,"484":2764,"810":2765,"873":2766,"478":2767,"066":2768,"038":2769,"65":2770,"622":2771,"270":2772,"953":2773,"63":2774,"939":2775,"886":2776,"412":2777,"215":2778,"595":2779,"175":2780,"403":2781,"367":2782,"278":2783,"089":2784,"635":2785,"128":2786,"056":2787,"966":2788,"160":2789,"156":2790,"650":2791,"measure":2792,"ratings":2793,"quoted":2794,"valuations":2795,"inputs":2796,"derived":2797,"corroborated":2798,"escrow":2799,"designated":2800,"80":2801,"assetbacked":2802,"classified":2803,"classifies":2804,"either":2805,"maturity":2806,"recorded":2807,"treatment":2808,"designation":2809,"subsequently":2810,"hedged":2811,"offsetting":2812,"forwards":2813,"options":2814,"designate":2815,"cross":2816,"swaps":2817,"designates":2818,"length":2819,"variability":2820,"remeasurement":2821,"functional":2822,"38":2823,"notional":2824,"647":2825,"069":2826,"875":2827,"575":2828,"079":2829,"rather":2830,"reduction":2831,"buildings":2832,"690":2833,"machinery":2834,"leasehold":2835,"091":2836,"125":2837,"76":2838,"014":2839,"448":2840,"499":2841,"335":2842,"919":2843,"024":2844,"granted":2845,"1991":2846,"2007":2847,"concerning":2848,"irish":2849,"branches":2850,"calculate":2851,"2003":2852,"2014":2853,"legislative":2854,"2015":2855,"eliminated":2856,"july":2857,"annulled":2858,"ecj":2859,"set":2860,"aside":2861,"confirmed":2862,"via":2863,"release":2864,"823":2865,"consisted":2866,"487":2867,"804":2868,"080":2869,"644":2870,"491":2871,"801":2872,"726":2873,"570":2874,"541":2875,"428":2876,"891":2877,"483":2878,"604":2879,"669":2880,"495":2881,"830":2882,"419":2883,"pretax":2884,"computed":2885,"applying":2886,"885":2887,"311":2888,"049":2889,"397":2890,"486":2891,"279":2892,"188":2893,"capitalized":2894,"041":2895,"739":2896,"carryforwards":2897,"643":2898,"856":2899,"577":2900,"341":2901,"417":2902,"451":2903,"007":2904,"551":2905,"674":2906,"678":2907,"455":2908,"471":2909,"805":2910,"202":2911,"carried":2912,"indefinitely":2913,"temporary":2914,"excludes":2915,"454":2916,"758":2917,"971":2918,"044":2919,"decreases":2920,"386":2921,"463":2922,"795":2923,"542":2924,"628":2925,"settlements":2926,"taxing":2927,"070":2928,"expiration":2929,"statute":2930,"494":2931,"242":2932,"2018":2933,"closure":2934,"possible":2935,"exceeding":2936,"multiyear":2937,"exercise":2938,"output":2939,"noncash":2940,"rou":2941,"033":2942,"303":2943,"579":2944,"911":2945,"144":2946,"692":2947,"752":2948,"720":2949,"430":2950,"42":2951,"530":2952,"988":2953,"061":2954,"899":2955,"2030":2956,"381":2957,"thereafter":2958,"956":2959,"757":2960,"undiscounted":2961,"725":2962,"imputed":2963,"235":2964,"349":2965,"584":2966,"490":2967,"230":2968,"discount":2969,"borrowing":2970,"implicit":2971,"readily":2972,"523":2973,"commenced":2974,"commence":2975,"ranging":2976,"nine":2977,"00":2978,"820":2979,"333":2980,"836":2981,"048":2982,"645":2983,"arrears":2984,"2013":2985,"issuances":2986,"2062":2987,"781":2988,"97":2989,"2035":2990,"281":2991,"unamortized":2992,"premium":2993,"309":2994,"358":2995,"662":2996,"convert":2997,"floating":2998,"393":2999,"078":3000,"972":3001,"88":3002,"402":3003,"425":3004,"401":3005,"372":3006,"58":3007,"approved":3008,"grants":3009,"permits":3010,"granting":3011,"appreciation":3012,"four":3013,"vesting":3014,"entitle":3015,"holders":3016,"grant":3017,"163":3018,"326":3019,"466":3020,"226":3021,"vested":3022,"forfeited":3023,"373":3024,"574":3025,"173":3026,"87":3027,"602":3028,"recognize":3029,"off":3030,"sheet":3031,"unconditional":3032,"981":3033,"306":3034,"opinion":3035,"least":3036,"possibility":3037,"accrual":3038,"asserted":3039,"ceo":3040,"consists":3041,"attributable":3042,"699":3043,"141":3044,"724":3045,"174":3046,"676":3047,"319":3048,"969":3049,"524":3050,"077":3051,"955":3052,"627":3053,"587":3054,"305":3055,"802":3056,"351":3057,"291":3058,"639":3059,"458":3060,"67":3061,"790":3062,"082":3063,"062":3064,"92":3065,"787":3066,"313":3067,"444":3068,"827":3069,"236":3070,"098":3071,"respective":3072,"totals":3073,"142":3074,"196":3075,"573":3076,"994":3077,"181":3078,"153":3079,"274":3080,"664":3081,"797":3082,"219":3083,"we":3084,"audited":3085,"our":3086,"fairly":3087,"respects":3088,"united":3089,"states":3090,"pcaob":3091,"criteria":3092,"_internal":3093,"framework_":3094,"sponsoring":3095,"organizations":3096,"treadway":3097,"framework":3098,"dated":3099,"unqualified":3100,"thereon":3101,"express":3102,"audits":3103,"conducted":3104,"misstatement":3105,"fraud":3106,"performing":3107,"examining":3108,"believe":3109,"matter":3110,"communicated":3111,"involved":3112,"challenging":3113,"subjective":3114,"alter":3115,"communicating":3116,"separate":3117,"account":3118,"description":3119,"auditing":3120,"sustained":3121,"measurement":3122,"addressed":3123,"tested":3124,"qualify":3125,"evaluated":3126,"qualifies":3127,"reading":3128,"detailed":3129,"merits":3130,"relation":3131,"served":3132,"auditor":3133,"2009":3134,"san":3135,"jose":3136,"coso":3137,"maintaining":3138,"understanding":3139,"exists":3140,"assessed":3141,"pertain":3142,"detail":3143,"dispositions":3144,"permit":3145,"receipts":3146,"authorizations":3147,"prevention":3148,"disposition":3149,"inherent":3150,"misstatements":3151,"projections":3152,"degree":3153,"deteriorate":3154,"ernst":3155,"young":3156,"llp":3157,"supervision":3158,"participation":3159,"concluded":3160,"13a":3161,"15d":3162,"disclosed":3163,"submits":3164,"processed":3165,"summarized":3166,"expect":3167,"operated":3168,"met":3169,"resource":3170,"detected":3171,"establishing":3172,"appears":3173,"paragraph":3174,"chris":3175,"kondo":3176,"his":3177,"mr":3178,"projects":3179,"ben":3180,"borders":3181,"assume":3182,"kevan":3183,"parekh":3184,"solicitation":3185,"proxies":3186,"id":3187,"00042":3188,"exhibits":3189,"restated":3190,"articles":3191,"bylaws":3192,"indenture":3193,"york":3194,"mellon":3195,"trustee":3196,"certificate":3197,"2043":3198,"2019":3199,"05":3200,"2044":3201,"february":3202,"2045":3203,"900":3204,"700":3205,"250":3206,"2036":3207,"2046":3208,"supplement":3209,"450":3210,"2047":3211,"800":3212,"2049":3213,"2050":3214,"2060":3215,"2041":3216,"2051":3217,"2061":3218,"2032":3219,"2052":3220,"2033":3221,"2053":3222,"agreement":3223,"unit":3224,"award":3225,"insider":3226,"consent":3227,"signatures":3228,"certification":3229,"1350":3230,"certifications":3231,"inline":3232,"xbrl":3233,"document":3234,"104":3235,"indicates":3236,"compensatory":3237,"herewith":3238,"furnished":3239,"defining":3240,"hereby":3241,"undertakes":3242,"furnish":3243,"copies":3244,"duly":3245,"signed":3246,"undersigned":3247,"thereunto":3248,"vice":3249,"president":3250,"know":3251,"person":3252,"whose":3253,"signature":3254,"constitutes":3255,"appoints":3256,"timothy":3257,"cook":3258,"jointly":3259,"severally":3260,"her":3261,"substitution":3262,"him":3263,"sign":3264,"thereto":3265,"documents":3266,"therewith":3267,"ratifying":3268,"confirming":3269,"said":3270,"substitute":3271,"substitutes":3272,"done":3273,"virtue":3274,"hereof":3275,"dates":3276,"timothyd":3277,"wanda":3278,"austin":3279,"alex":3280,"gorsky":3281,"andrea":3282,"jung":3283,"arthur":3284,"levinson":3285,"monica":3286,"lozano":3287,"ronald":3288,"sugar":3289,"susan":3290,"wagner":3291,"eight":3292,"vi":3293,"vii":3294,"viii":3295,"listed":3296,"qualified":3297,"entirety":3298,"nonassessable":3299,"vote":3300,"voted":3301,"affirmative":3302,"constitute":3303,"quorum":3304,"election":3305,"nominees":3306,"candidates":3307,"receiving":3308,"highest":3309,"votes":3310,"removed":3311,"vacancies":3312,"removal":3313,"approval":3314,"unanimous":3315,"written":3316,"elect":3317,"fill":3318,"vacancy":3319,"amendment":3320,"specifying":3321,"versa":3322,"cast":3323,"adjourned":3324,"discretion":3325,"legally":3326,"therefor":3327,"liquidation":3328,"dissolution":3329,"winding":3330,"rata":3331,"preemptive":3332,"conversion":3333,"redemption":3334,"sinking":3335,"fund":3336,"discourage":3337,"deem":3338,"interests":3339,"office":3340,"sole":3341,"nominate":3342,"writing":3343,"specify":3344,"14a":3345,"group":3346,"continuously":3347,"constituting":3348,"nominee":3349,"special":3350,"meetings":3351,"called":3352,"ten":3353,"percent":3354,"corporation":3355,"1203":3356,"fairness":3357,"interested":3358,"reorganization":3359,"purport":3360,"indentures":3361,"us":3362,"context":3363,"governed":3364,"construed":3365,"thereunder":3366,"ranking":3367,"equally":3368,"begins":3369,"accrue":3370,"isin":3371,"annum":3372,"annually":3373,"semiannually":3374,"semi":3375,"indebtedness":3376,"rank":3377,"unsubordinated":3378,"structurally":3379,"subordinated":3380,"preferred":3381,"secured":3382,"securing":3383,"creditors":3384,"stockholders":3385,"euro":3386,"unavailable":3387,"longer":3388,"member":3389,"banking":3390,"community":3391,"again":3392,"converted":3393,"mandated":3394,"reserve":3395,"published":3396,"wall":3397,"street":3398,"journal":3399,"means":3400,"sunday":3401,"city":3402,"london":3403,"trans":3404,"automated":3405,"real":3406,"target2":3407,"successor":3408,"pounds":3409,"sterling":3410,"kingdom":3411,"adopts":3412,"lawful":3413,"redenominated":3414,"pound":3415,"case":3416,"clear":3417,"deduction":3418,"withholding":3419,"duties":3420,"whatsoever":3421,"deducted":3422,"subdivision":3423,"authority":3424,"covenant":3425,"exceptions":3426,"paying":3427,"agent":3428,"holder":3429,"shall":3430,"owner":3431,"fiduciary":3432,"settlor":3433,"beneficiary":3434,"estate":3435,"partnership":3436,"administered":3437,"having":3438,"engaged":3439,"permanent":3440,"establishment":3441,"former":3442,"receipt":3443,"hereunder":3444,"citizen":3445,"resident":3446,"passive":3447,"controlled":3448,"871":3449,"1986":3450,"864":3451,"extension":3452,"loan":3453,"distributive":3454,"nationality":3455,"residence":3456,"identity":3457,"therein":3458,"treaty":3459,"precondition":3460,"exemption":3461,"requirement":3462,"8ben":3463,